main_menu = '''Главное меню:
    1. Открыть файл
    2. Сохранить файл
    3. Показать все контакты
    4. Создать конакт
    5. Найти контакт
    6. Изменить контакт
    7. Удалить контакт
    8. Выход
    '''
choice_menu = 'Выберите пункт меню: '
input_num_menu = 'Введите цифру от 1 до 8'
no_contacts_or_file = 'Телефонная книга пуста или не открыта'

load_successful = 'Телефонная книга успешно загружена'
new_contact_successful = 'Новый контакт успешно создан!'
save_successful = 'Телефонная книга успешно сохранена!'
is_changed = 'Были внесены изменения. Сохранить? '

find_word = 'Введите данные для поиска контакта: '
find_error = 'Контакта с такими данными не найдено!'
find_count = 'Найдено совпадений:'

change_data_info = 'Введите новые данные: '
change_contact_info = 'Введите номер контакта, который нужно изменить: '
change_contact = '''    Введите 1, если хотите отредактировать ФИО,
            2, если хотите отредактировать номер,
            3, если хотите отредактировать комментарий: '''
changed_successful = 'Контакт успешно изменен!'

new_name = 'Введите имя и фамилию контакта: '
new_phone = 'Введите телефон контакта: '
new_comment = 'Введите комментарий к контакту: '

del_successful = 'Контакт успешно удален!'
del_contact_info = 'Выберите номер контакта, который хотите удалить: '

bye_bye = 'До свидания'
